// Preflight
"DISK_FULL_TITLE" = "Kovalevyllä ei ole tarpeeksi tilaa.";
"DISK_FULL_FOR_DOWNLOAD_STATUS" = "Päivitysten lataamiseen tarvitaan %@. Vapauta tilaa poistamalla tiedostoja kovalevyltä ja yritä uudelleen.";
"DISK_FULL_FOR_DOWNLOAD_AND_INSTALL_STATUS" = "Päivitysten lataamiseen ja asentamiseen tarvitaan %@. Vapauta tilaa poistamalla tiedostoja käynnistyslevyltä ja yritä uudelleen.";

// AC power check
"CONFIRM_NO_POWER_ADAPTER_TITLE" = "Tietokonetta ei ole liitetty virtalähteeseen.";
"CONFIRM_NO_POWER_ADAPTER_MESSAGE" = "Tietokone kannattaa liittää virtalähteeseen ennen asennuksen aloittamista. Haluatko varmasti jatkaa asennusta?";
"CONTINUE_TITLE" = "Jatka";

"CANCEL_TITLE" = "Kumoa";

// Session error
"UPDATE_DOWNLOAD_ERROR" = "Päivitystä ”%@” ei voitu tallentaa.";
"NONE_CHECKED_DOWNLOAD_ERROR" = "Yhtään valittua päivitystä ei voitu tallentaa.";
"SOME_CHECKED_DOWNLOAD_ERROR" = "Osaa valituista päivityksistä ei voitu tallentaa.";

"UPDATE_INSTALL_ERROR" = "Päivitystä ”%@” ei voitu asentaa.";
"NONE_CHECKED_INSTALL_ERROR" = "Yhtään valittua päivitystä ei voitu asentaa.";
"SOME_CHECKED_INSTALL_ERROR" = "Osaa valituista päivityksistä ei voitu asentaa.";

"OK_TITLE" = "OK";

// Pre-session error
"UPDATE_NOT_FOUND_ERROR" = "Päivitystä ei voida asentaa.";

// 3B) Updated downloaded, time to logout and install
"UPDATES_DOWNLOADED_INSTALL_AND_LOGOUT_MESSAGE" = "Päivitysten asentamiseksi sinun tulee kirjautua ulos.";
"UPDATES_DOWNLOADED_INSTALL_AND_LOGOUT_INFORMATIVE" = "Viimeistele asennus ja kirjaudu ulos osoittamalla Kirjaudu ulos.";
"LOG_OUT_AND_INSTALL_TITLE" = "Kirjaudu ulos";

"UPDATES_DOWNLOADED_INSTALL_AND_RESTART_MESSAGE" = "Tietokone on käynnistettävä uudelleen, jotta päivitykset voidaan asentaa.";
"UPDATES_DOWNLOADED_INSTALL_AND_RESTART_INFORMATIVE" = "Viimeistele asennus ja käynnistä tietokone uudelleen osoittamalla Käynnistä uudelleen.";
"LOG_OUT_AND_INSTALL_AND_RESTART_TITLE" = "Käynnistä uudelleen";

"UPDATES_DOWNLOADED_INSTALL_AND_SHUTDOWN_MESSAGE" = "Jos haluat asentaa päivitykset, tietokone on sammutettava.";
"UPDATES_DOWNLOADED_INSTALL_AND_SHUTDOWN_INFORMATIVE" = "Viimeistele asennus ja sulje tietokone osoittamalla Sammuta. Käynnistä tietokone uudelleen painamalla käynnistyspainiketta.";
"LOG_OUT_AND_INSTALL_AND_SHUTDOWN_TITLE" = "Sammuta";

"NOT_NOW_TITLE" = "Ei nyt";

// Predicate installs
"DEFAULT_PREDICATE_BLOCKED_MESSAGE" = "Kun toinen päivitys on suoritettu, voit ladata ja asentaa tämän ohjelmiston valitsemalla Omenavalikosta Ohjelmiston päivitys.";
"DEFAULT_NO_NETWORK_MESSAGE" = "Kun olet seuraavan kerran Internet-yhteydessä, voit ladata ja asentaa ohjelmiston valitsemalla Omenavalikosta Ohjelmiston päivitys.";
"STANDARD_NO_SUS_MESSAGE" = "Varmista, että verkkoyhteys toimii normaalisti. Jos yhteyden kanssa ei ole ongelmia, pyydä apua verkon ylläpitäjältä.";
"NO_UPDATE_FOUND_ERROR" = "Ohjelmisto ei ole tällä hetkellä käytettävissä.";
